valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
/*
 * Pressure Control Configuration and Calibration Implementation
 * Valeh Injection System - Configuration Management
 * 
 * This file implements all configuration management, calibration,
 * and parameter tuning functions for the pressure control system.
 */

#include "pressure_control_config.h"
#include "advanced_pressure_control.h"
#include "ILI9341_FSMC.h"
#include "main.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "stm32f4xx_hal.h"

/* =========================================================================
   GLOBAL CONFIGURATION VARIABLES
   ========================================================================= */

System_Config_t g_system_config = {
    .system_name = CONFIG_SYSTEM_NAME,
    .version = CONFIG_VERSION,
    .build_date = CONFIG_BUILD_DATE,
    .debug_enabled = true,
    .safety_enabled = true
};

PID_Tuning_t g_pid_zme_tuning = {
    .kp = CONFIG_PID_ZME_KP_DEFAULT,
    .ki = CONFIG_PID_ZME_KI_DEFAULT,
    .kd = CONFIG_PID_ZME_KD_DEFAULT,
    .auto_tune_enabled = false,
    .tuning_aggressiveness = 1.0f
};

PID_Tuning_t g_pid_drv_tuning = {
    .kp = CONFIG_PID_DRV_KP_DEFAULT,
    .ki = CONFIG_PID_DRV_KI_DEFAULT,
    .kd = CONFIG_PID_DRV_KD_DEFAULT,
    .auto_tune_enabled = false,
    .tuning_aggressiveness = 1.0f
};

// KRİTİK DÜZƏLİŞ: Slope və offset default dəyərlərlə hesablanmalıdır!
// Əvvəlki kod slope=0.0f və calibrated=false idi, bu da bütün təzyiq oxunuşlarının 0 olmasına səbəb olurdu!
// 
// Düzgün hesablama:
// slope = (pressure_max - pressure_min) / (adc_max - adc_min)
//       = (300.0 - 0.0) / (CONFIG_PRESSURE_SENSOR_ADC_MAX - CONFIG_PRESSURE_SENSOR_ADC_MIN)
// offset = pressure_min - (slope * adc_min)
//        = 0.0 - (slope * CONFIG_PRESSURE_SENSOR_ADC_MIN)
#define CONFIG_PRESSURE_SLOPE ((CONFIG_PRESSURE_SENSOR_PRESSURE_MAX - CONFIG_PRESSURE_SENSOR_PRESSURE_MIN) / \
                               (float)(CONFIG_PRESSURE_SENSOR_ADC_MAX - CONFIG_PRESSURE_SENSOR_ADC_MIN))
#define CONFIG_PRESSURE_OFFSET (CONFIG_PRESSURE_SENSOR_PRESSURE_MIN - \
                                (CONFIG_PRESSURE_SLOPE * (float)CONFIG_PRESSURE_SENSOR_ADC_MIN))

Calibration_Data_t g_calibration_data = {
    .adc_min = CONFIG_PRESSURE_SENSOR_ADC_MIN,
    .adc_max = CONFIG_PRESSURE_SENSOR_ADC_MAX,
    .pressure_min = CONFIG_PRESSURE_SENSOR_PRESSURE_MIN,
    .pressure_max = CONFIG_PRESSURE_SENSOR_PRESSURE_MAX,
    .slope = CONFIG_PRESSURE_SLOPE,      // DÜZƏLİŞ: Default slope hesablandı
    .offset = CONFIG_PRESSURE_OFFSET,    // DÜZƏLİŞ: Default offset hesablandı
    .calibrated = true,                  // DÜZƏLİŞ: Default dəyərlərlə calibrated=true
    .calibration_date = 0
};

Valve_Config_t g_valve_config = {
    .zme_pwm_min = CONFIG_ZME_PWM_MIN,
    .zme_pwm_max = CONFIG_ZME_PWM_MAX,
    .zme_cutoff_pwm = CONFIG_ZME_CUTOFF_PWM,
    .zme_min_working = CONFIG_ZME_MIN_WORKING,
    .drv_pwm_min = CONFIG_DRV_PWM_MIN,
    .drv_pwm_max = CONFIG_DRV_PWM_MAX,
    .motor_pwm_min = CONFIG_MOTOR_PWM_MIN,
    .motor_pwm_max = CONFIG_MOTOR_PWM_MAX
};

Safety_Config_t g_safety_config = {
    .max_pressure = CONFIG_SAFETY_MAX_PRESSURE,
    .over_limit_margin = CONFIG_SAFETY_OVER_LIMIT_MARGIN,
    .emergency_threshold = CONFIG_SAFETY_EMERGENCY_THRESHOLD,
    .safety_enabled = true
};

/* =========================================================================
   CONFIGURATION MANAGEMENT FUNCTIONS
   ========================================================================= */

/**
 * @brief Initialize configuration system
 */
void PressureControlConfig_Init(void) {
    printf("Pressure Control Configuration - Initializing...\r\n");
    
    // Load configuration from flash
    PressureControlConfig_LoadFromFlash();
    
    // Load PID parameters and SP from flash (important - must be called early)
    PressureControlConfig_LoadPIDParams();
    
    // Apply PID tuning parameters to AdvancedPressureControl system
    // This ensures that g_pid_zme_tuning and g_pid_drv_tuning values are applied
    // even if flash loading didn't happen or returned early
    PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, 
                                       g_pid_zme_tuning.kp, 
                                       g_pid_zme_tuning.ki, 
                                       g_pid_zme_tuning.kd);
    PressureControlConfig_SetPIDTuning(&g_pid_drv_tuning, 
                                       g_pid_drv_tuning.kp, 
                                       g_pid_drv_tuning.ki, 
                                       g_pid_drv_tuning.kd);
    
    // KRİTİK DÜZƏLİŞ: Slope və offset HƏMİŞƏ hesablanmalıdır!
    // Əvvəlki kod yalnız calibrated=true olduqda hesablayırdı, bu da
    // Flash-da data olmadıqda slope=0 qalması və təzyiqin həmişə 0 göstərməsinə səbəb olurdu.
    // 
    // Yeni məntiq: Slope və offset həmişə hesablanır, əgər ADC aralığı valid-dirsə
    if (g_calibration_data.adc_max > g_calibration_data.adc_min) {
        g_calibration_data.slope = (g_calibration_data.pressure_max - g_calibration_data.pressure_min) / 
                                  (g_calibration_data.adc_max - g_calibration_data.adc_min);
        g_calibration_data.offset = g_calibration_data.pressure_min - 
                                   (g_calibration_data.slope * g_calibration_data.adc_min);
        g_calibration_data.calibrated = true;
        
        printf("Config: Calibration slope calculated: %.6f bar/ADC, offset: %.2f bar\r\n",
               g_calibration_data.slope, g_calibration_data.offset);
    } else {
        // ADC aralığı invalid - default dəyərləri istifadə et
        printf("ERROR: Invalid ADC range (min=%.0f, max=%.0f), using defaults\r\n",
               g_calibration_data.adc_min, g_calibration_data.adc_max);
        g_calibration_data.adc_min = (float)CONFIG_PRESSURE_SENSOR_ADC_MIN;
        g_calibration_data.adc_max = (float)CONFIG_PRESSURE_SENSOR_ADC_MAX;
        g_calibration_data.slope = CONFIG_PRESSURE_SLOPE;
        g_calibration_data.offset = CONFIG_PRESSURE_OFFSET;
        g_calibration_data.calibrated = true;
    }
    
