valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
    printf("Configuration initialized successfully\r\n");
    PressureControlConfig_PrintSystemInfo();
}

/**
 * @brief Load default configuration
 */
void PressureControlConfig_LoadDefaults(void) {
    printf("Loading default configuration...\r\n");
    
    // Reset all configurations to defaults
    g_pid_zme_tuning.kp = CONFIG_PID_ZME_KP_DEFAULT;
    g_pid_zme_tuning.ki = CONFIG_PID_ZME_KI_DEFAULT;
    g_pid_zme_tuning.kd = CONFIG_PID_ZME_KD_DEFAULT;
    
    g_pid_drv_tuning.kp = CONFIG_PID_DRV_KP_DEFAULT;
    g_pid_drv_tuning.ki = CONFIG_PID_DRV_KI_DEFAULT;
    g_pid_drv_tuning.kd = CONFIG_PID_DRV_KD_DEFAULT;
    
    // Apply default PID tuning values to AdvancedPressureControl system
    PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, 
                                       g_pid_zme_tuning.kp, 
                                       g_pid_zme_tuning.ki, 
                                       g_pid_zme_tuning.kd);
    PressureControlConfig_SetPIDTuning(&g_pid_drv_tuning, 
                                       g_pid_drv_tuning.kp, 
                                       g_pid_drv_tuning.ki, 
                                       g_pid_drv_tuning.kd);
    
    g_safety_config.max_pressure = CONFIG_SAFETY_MAX_PRESSURE;
    g_safety_config.over_limit_margin = CONFIG_SAFETY_OVER_LIMIT_MARGIN;
    g_safety_config.emergency_threshold = CONFIG_SAFETY_EMERGENCY_THRESHOLD;
    
    g_valve_config.zme_pwm_min = CONFIG_ZME_PWM_MIN;
    g_valve_config.zme_pwm_max = CONFIG_ZME_PWM_MAX;
    g_valve_config.zme_cutoff_pwm = CONFIG_ZME_CUTOFF_PWM;
    
    printf("Default configuration loaded\r\n");
}

/**
 * @brief Save configuration to flash memory
 */
void PressureControlConfig_SaveToFlash(void) {
    printf("Saving system configuration to flash...\r\n");
    
    // Save all configuration data
    PressureControlConfig_SavePIDParams();
    PressureControlConfig_SaveCalibrationData();
    
    printf("System configuration saved to flash memory\r\n");
}

/**
 * @brief Load configuration from flash memory
 */
void PressureControlConfig_LoadFromFlash(void) {
    printf("Loading system configuration from flash...\r\n");
    
    // Load all configuration data
    PressureControlConfig_LoadPIDParams();
    PressureControlConfig_LoadCalibrationData();
    
    printf("System configuration loaded from flash memory\r\n");
}

/* =========================================================================
   PID TUNING FUNCTIONS
   ========================================================================= */

/**
 * @brief Set PID tuning parameters
 */
void PressureControlConfig_SetPIDTuning(PID_Tuning_t* tuning, float kp, float ki, float kd) {
    if (PressureControlConfig_ValidatePIDParams(kp, ki, kd)) {
        tuning->kp = kp;
        tuning->ki = ki;
        tuning->kd = kd;
        
        // Apply to active PID controllers
        if (tuning == &g_pid_zme_tuning) {
            AdvancedPressureControl_SetPIDParams(&g_pid_zme, kp, ki, kd);
        } else if (tuning == &g_pid_drv_tuning) {
            AdvancedPressureControl_SetPIDParams(&g_pid_drv, kp, ki, kd);
        }
        
        printf("PID tuning updated: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", kp, ki, kd);
    } else {
        printf("Invalid PID parameters: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", kp, ki, kd);
    }
}

/**
 * @brief Enable/disable auto-tuning
 */
void PressureControlConfig_EnableAutoTune(PID_Tuning_t* tuning, bool enable) {
    tuning->auto_tune_enabled = enable;
    printf("Auto-tuning %s for PID controller\r\n", enable ? "enabled" : "disabled");
}

/**
 * @brief Set tuning aggressiveness
 */
void PressureControlConfig_SetTuningAggressiveness(PID_Tuning_t* tuning, float aggressiveness) {
    tuning->tuning_aggressiveness = fmaxf(0.1f, fminf(2.0f, aggressiveness));
    printf("Tuning aggressiveness set to %.2f\r\n", tuning->tuning_aggressiveness);
}

/**
 * @brief Reset PID tuning to defaults
 */
void PressureControlConfig_ResetPIDTuning(PID_Tuning_t* tuning) {
    if (tuning == &g_pid_zme_tuning) {
        tuning->kp = CONFIG_PID_ZME_KP_DEFAULT;
        tuning->ki = CONFIG_PID_ZME_KI_DEFAULT;
        tuning->kd = CONFIG_PID_ZME_KD_DEFAULT;
    } else if (tuning == &g_pid_drv_tuning) {
        tuning->kp = CONFIG_PID_DRV_KP_DEFAULT;
        tuning->ki = CONFIG_PID_DRV_KI_DEFAULT;
        tuning->kd = CONFIG_PID_DRV_KD_DEFAULT;
    }
    
    // Apply reset values to AdvancedPressureControl system
    PressureControlConfig_SetPIDTuning(tuning, tuning->kp, tuning->ki, tuning->kd);
    
    printf("PID tuning reset to defaults\r\n");
}

/* =========================================================================
   CALIBRATION FUNCTIONS
   ========================================================================= */

/**
 * @brief Start calibration process
 */
void PressureControlConfig_StartCalibration(void) {
    printf("Starting pressure sensor calibration...\r\n");
    printf("Please ensure pressure sensor is at 0 bar (atmospheric pressure)\r\n");
    
    g_calibration_data.calibrated = false;
    g_calibration_data.calibration_date = HAL_GetTick();
}

/**
 * @brief Add calibration point
 */
void PressureControlConfig_AddCalibrationPoint(float adc_value, float pressure_value) {
    printf("Calibration point added: ADC=%.0f, Pressure=%.2f bar\r\n", adc_value, pressure_value);
    
    // Update calibration data
    if (pressure_value == 0.0f) {
        g_calibration_data.adc_min = adc_value;
        g_calibration_data.pressure_min = pressure_value;
    } else {
        g_calibration_data.adc_max = adc_value;
        g_calibration_data.pressure_max = pressure_value;
    }
}

/**
 * @brief Complete calibration process
 * 
 * KRİTİK DÜZƏLİŞ: ADC aralığı validasiyası gücləndirildi.
 * Minimum ADC aralığı (2000) tələb olunur ki, slope çox kiçik olmasın.
 */
void PressureControlConfig_CompleteCalibration(void) {
    // ADC aralığı validasiyası
    float adc_range = g_calibration_data.adc_max - g_calibration_data.adc_min;
    
    // Minimum aralıq yoxlaması - slope çox kiçik olmamalıdır
    const float MIN_ADC_RANGE = 1500.0f;  // Minimum 1500 ADC count fərq olmalıdır
    
    if (g_calibration_data.adc_max > g_calibration_data.adc_min && adc_range >= MIN_ADC_RANGE) {
        // Calculate slope and offset
        g_calibration_data.slope = (g_calibration_data.pressure_max - g_calibration_data.pressure_min) / adc_range;
        g_calibration_data.offset = g_calibration_data.pressure_min - 
                                   (g_calibration_data.slope * g_calibration_data.adc_min);
        g_calibration_data.calibrated = true;
        g_calibration_data.calibration_date = HAL_GetTick();
        
        printf("Calibration completed successfully\r\n");
        printf("  ADC Range: %.0f - %.0f (range: %.0f)\r\n", 
               g_calibration_data.adc_min, g_calibration_data.adc_max, adc_range);
        printf("  Pressure Range: %.2f - %.2f bar\r\n",
               g_calibration_data.pressure_min, g_calibration_data.pressure_max);
        printf("  Slope: %.6f bar/ADC\r\n", g_calibration_data.slope);
        printf("  Offset: %.2f bar\r\n", g_calibration_data.offset);
        
        // Advanced sistemdəki kalibrasiya strukturunu da yenilə
        extern CalibrationData_t g_calibration;
        g_calibration.adc_min = g_calibration_data.adc_min;
        g_calibration.adc_max = g_calibration_data.adc_max;
        g_calibration.pressure_min = g_calibration_data.pressure_min;
        g_calibration.pressure_max = g_calibration_data.pressure_max;
        g_calibration.slope = g_calibration_data.slope;
        g_calibration.offset = g_calibration_data.offset;
        g_calibration.calibrated = true;
        
        PressureControlConfig_PrintCalibrationData();
        
