valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
/* Flash memory structure for PID and system parameters */
/* NOTE: Using offset 0x200 to avoid conflict with AdvancedPressureControl (0x000) and Calibration (0x100) */
#define FLASH_CONFIG_ADDRESS    (0x080E0000 + 0x200)  /* Sector 11, offset 0x200 for pressure_control_config */
#define FLASH_CONFIG_MAGIC      0x87654321UL  /* Magic number to verify valid data (different from others) */

typedef struct {
    uint32_t magic;              /* Magic number: 0x87654321 */
    float pid_kp;                /* Kp parameter */
    float pid_ki;                /* Ki parameter */
    float pid_kd;                /* Kd parameter */
    float setpoint;              /* SetPoint (SP) value */
    uint32_t checksum;           /* Simple checksum */
} Flash_Config_Data_t;

/**
 * @brief Calculate simple checksum
 */
static uint32_t CalculateChecksum(float kp, float ki, float kd, float sp) {
    uint32_t *kp_ptr = (uint32_t*)&kp;
    uint32_t *ki_ptr = (uint32_t*)&ki;
    uint32_t *kd_ptr = (uint32_t*)&kd;
    uint32_t *sp_ptr = (uint32_t*)&sp;
    return (uint32_t)FLASH_CONFIG_MAGIC ^ *kp_ptr ^ *ki_ptr ^ *kd_ptr ^ *sp_ptr;
}

/**
 * @brief Save PID parameters and SP to flash
 */
void PressureControlConfig_SavePIDParams(void) {
    printf("Saving PID parameters to flash...\r\n");
    
    // Prepare data structure
    Flash_Config_Data_t config_data;
    config_data.magic = FLASH_CONFIG_MAGIC;
    config_data.pid_kp = g_pid_zme_tuning.kp;
    config_data.pid_ki = g_pid_zme_tuning.ki;
    config_data.pid_kd = g_pid_zme_tuning.kd;
    
    // Get current SP value - DÜZƏLİŞ: g_system_status.target_pressure-dən götür
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    config_data.setpoint = status->target_pressure;  // target_pressure dəyərini istifadə et
    
    // Calculate checksum
    config_data.checksum = CalculateChecksum(
        config_data.pid_kp, config_data.pid_ki, 
        config_data.pid_kd, config_data.setpoint);
    
    // KRİTİK DÜZƏLİŞ: Mərkəzləşdirilmiş Flash Yaddaş Məntiqindən istifadə et
    // block_type = 2 (Config PID)
    // Bütün doğrulama, printf mesajları və xəta yoxlamaları mərkəzləşdirilmiş funksiyanın daxilində həyata keçirilir
    AdvancedPressureControl_SaveToFlash_Centralized(
        2,  // block_type: Config PID
        &config_data,
        sizeof(Flash_Config_Data_t)
    );
}

/**
 * @brief Load PID parameters and SP from flash
 * 
 * ⚠️ KRİTİK XƏBƏRDARLIQ: Bu funksiya Config sisteminin daxili strukturlarını (g_pid_zme_tuning, g_pid_drv_tuning) yeniləyir
 * və Advanced sistemin funksiyalarını çağırır. Lakin Advanced sistem artıq öz funksiyasını 
 * (AdvancedPressureControl_LoadPIDParamsFromFlash) çağırır və fərqli Flash offset-dən (0x000) oxuyur.
 * 
 * Bu, ikiqat Flash əməliyyatı və məlumat ziddiyyəti riskini yaradır.
 * 
 * Tövsiyə: Bütün Flash əməliyyatları yalnız Advanced sistemdə mərkəzləşdirilməlidir.
 * Config sistemi yalnız Advanced sistemin setter funksiyalarını çağırmalıdır.
 */
void PressureControlConfig_LoadPIDParams(void) {
    printf("Loading PID parameters from flash (Config system, offset 0x200)...\r\n");
    
    // Read data from flash
    Flash_Config_Data_t *config_data = (Flash_Config_Data_t*)FLASH_CONFIG_ADDRESS;
    
    printf("Flash address: 0x%08lX\r\n", (uint32_t)FLASH_CONFIG_ADDRESS);
    printf("Read magic: 0x%08lX (expected: 0x%08lX)\r\n", 
           config_data->magic, FLASH_CONFIG_MAGIC);
    
    // Verify magic number
    if (config_data->magic != FLASH_CONFIG_MAGIC) {
        printf("No valid configuration found in flash, using defaults\r\n");
        // Apply default PID tuning values to AdvancedPressureControl system
        PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, 
                                           g_pid_zme_tuning.kp, 
                                           g_pid_zme_tuning.ki, 
                                           g_pid_zme_tuning.kd);
        PressureControlConfig_SetPIDTuning(&g_pid_drv_tuning, 
                                           g_pid_drv_tuning.kp, 
                                           g_pid_drv_tuning.ki, 
                                           g_pid_drv_tuning.kd);
        return;
    }
    
    // Verify checksum
    uint32_t calculated_checksum = CalculateChecksum(
        config_data->pid_kp, config_data->pid_ki,
        config_data->pid_kd, config_data->setpoint);
    
    printf("Read checksum: 0x%08lX, Calculated: 0x%08lX\r\n",
           config_data->checksum, calculated_checksum);
    
    if (calculated_checksum != config_data->checksum) {
        printf("Checksum mismatch, using defaults\r\n");
        // Apply default PID tuning values to AdvancedPressureControl system
        PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, 
                                           g_pid_zme_tuning.kp, 
                                           g_pid_zme_tuning.ki, 
                                           g_pid_zme_tuning.kd);
        PressureControlConfig_SetPIDTuning(&g_pid_drv_tuning, 
                                           g_pid_drv_tuning.kp, 
                                           g_pid_drv_tuning.ki, 
                                           g_pid_drv_tuning.kd);
        return;
    }
    
    // Load PID parameters
    // Check if loaded values are old defaults and update to new defaults if so
    // Old defaults: Kp=1.5, Ki=0.005, Kd=0.0 (pressure_control_config.h)
    // Old defaults: Kp=0.5, Ki=0.0010, Kd=0.0 (advanced_pressure_control.h)
    bool is_old_default_1 = (fabsf(config_data->pid_kp - 0.5f) < 0.01f) && 
                            (fabsf(config_data->pid_ki - 0.0010f) < 0.0001f) && 
                            (fabsf(config_data->pid_kd - 0.0f) < 0.01f);
    
    bool is_old_default_2 = (fabsf(config_data->pid_kp - 1.5f) < 0.01f) && 
                            (fabsf(config_data->pid_ki - 0.005f) < 0.0001f) && 
                            (fabsf(config_data->pid_kd - 0.0f) < 0.01f);
    
    if (is_old_default_1 || is_old_default_2) {
        printf("Old default PID values detected in flash (Kp=%.3f, Ki=%.4f, Kd=%.3f), updating to new defaults\r\n",
               config_data->pid_kp, config_data->pid_ki, config_data->pid_kd);
        g_pid_zme_tuning.kp = CONFIG_PID_ZME_KP_DEFAULT;
        g_pid_zme_tuning.ki = CONFIG_PID_ZME_KI_DEFAULT;
        g_pid_zme_tuning.kd = CONFIG_PID_ZME_KD_DEFAULT;
        g_pid_drv_tuning.kp = CONFIG_PID_DRV_KP_DEFAULT;
        g_pid_drv_tuning.ki = CONFIG_PID_DRV_KI_DEFAULT;
        g_pid_drv_tuning.kd = CONFIG_PID_DRV_KD_DEFAULT;
    } else {
        g_pid_zme_tuning.kp = config_data->pid_kp;
        g_pid_zme_tuning.ki = config_data->pid_ki;
        g_pid_zme_tuning.kd = config_data->pid_kd;
        // Config sistemində DRV də eyni dəyərləri istifadə edir
        g_pid_drv_tuning.kp = config_data->pid_kp;
        g_pid_drv_tuning.ki = config_data->pid_ki;
        g_pid_drv_tuning.kd = config_data->pid_kd;
    }
    
