valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
    // Load default configuration
    PressureControlConfig_LoadDefaults();
    
    // Reset calibration
    PressureControlConfig_ResetCalibration();
    
    printf("Configuration reset to defaults - Complete\r\n");
}

/**
 * @brief Start auto-tuning
 */
void PressureControlConfig_StartAutoTuning(void) {
    printf("Auto-tuning started for ZME controller\r\n");
    g_pid_zme_tuning.auto_tune_enabled = true;
}

/**
 * @brief Stop auto-tuning
 */
void PressureControlConfig_StopAutoTuning(void) {
    printf("Auto-tuning stopped for ZME controller\r\n");
    g_pid_zme_tuning.auto_tune_enabled = false;
}

/**
 * @brief Check if auto-tuning is active
 */
bool PressureControlConfig_IsAutoTuningActive(void) {
    return g_pid_zme_tuning.auto_tune_enabled || g_pid_drv_tuning.auto_tune_enabled;
}

/**
 * @brief Optimize PID parameters
 */
void PressureControlConfig_OptimizePIDParams(void) {
    printf("PID parameter optimization - Starting...\r\n");
    
    // Simple optimization algorithm
    // This is a placeholder - real optimization would be more complex
    
    // Adjust Kp based on system response
    if (g_pid_zme_tuning.kp < 1.0f) {
        g_pid_zme_tuning.kp += 0.1f;
    } else if (g_pid_zme_tuning.kp > 3.0f) {
        g_pid_zme_tuning.kp -= 0.1f;
    }
    
    // Adjust Ki based on steady-state error
    if (g_pid_zme_tuning.ki < 0.001f) {
        g_pid_zme_tuning.ki += 0.0001f;
    } else if (g_pid_zme_tuning.ki > 0.01f) {
        g_pid_zme_tuning.ki -= 0.0001f;
    }
    
    printf("PID parameter optimization - Complete\r\n");
    printf("New ZME PID: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", 
           g_pid_zme_tuning.kp, g_pid_zme_tuning.ki, g_pid_zme_tuning.kd);
}

/**
 * @brief Update calibration cache from source data
 * @param source Pointer to source calibration data
 * @note This function synchronizes calibration data between modules
 */
void PressureControlConfig_UpdateCalibrationCache(const CalibrationData_t* source) {
    if (source == NULL) {
        printf("ERROR: UpdateCalibrationCache called with NULL pointer\r\n");
        return;
    }
    
    // Update the configuration system's calibration cache
    g_calibration_data.adc_min = source->adc_min;
    g_calibration_data.adc_max = source->adc_max;
    g_calibration_data.pressure_min = source->pressure_min;
    g_calibration_data.pressure_max = source->pressure_max;
    g_calibration_data.slope = source->slope;
    g_calibration_data.offset = source->offset;
    g_calibration_data.calibrated = source->calibrated;
    g_calibration_data.calibration_date = source->calibration_date;
    
    printf("Calibration cache updated: ADC[%.0f-%.0f] -> Pressure[%.1f-%.1f] bar\r\n",
           g_calibration_data.adc_min, g_calibration_data.adc_max,
           g_calibration_data.pressure_min, g_calibration_data.pressure_max);
}
